(function(){
IX.ns("TNM.Const");
TNM.Const.MaxUnitInRack = 42;
TNM.Const.PXPerUnit = 17;

TNM.Const.FaultLevels = {
	0 : "正常",
	1 : "一般",
	2 : "严重"
};

TNM.Const.FaultCodes = {
	UNKNOWN : -1,	// 未知报警

	DISK_ERROR : 0,	// 磁盘错误
	DISK_WRITE_FAILED		: 1,	// 磁盘不能写
	DISK_FULL				: 2,	// 磁盘满
	BROKEN					: 3,	// 设备断线
	BROKEN_RESUME			: 4,	// 设备断线恢复

	VIDEO_LOST				: 100,	// 视频丢失
	VIDEO_HIDE				: 101,	// 视频遮挡
	INPUT					: 102,	// 报警输入报警
	ANALYSIS				: 103	// 智能分析报警
};
TNM.Const.FaultFormats = {
	"-1" : "发生异常报警",

	//脉冲事件
	101 : "系统初始化",
	103 : "用户登入",
	105 : "用户注销",
	107 : "监视器切换",
	109 : "云台控制",
	111 : "打开视频文件",
	113 : "关闭视频文件",
	115 : "报警设备报告信息",
	117 : "智能报警事件",
	119 : "OSD信息变化",
	//设备报警事件
	201 : "CPU使用率过高",
	203 : "内存使用率过高",
	205 : "磁盘阵列不能写",
	207 : "磁盘阵列不能读写",
	209 : "磁盘阵列没有做RAID",
	211 : "通道损坏",
	213 : "端口电压异常",
	215 : "端口电流异常",
	217 : "磁盘满",
	219 : "存储文件的完整性检测报警",
	221 : "授权文件错误",
	223 : "授权文件恢复",
	225 : "电源关闭或异常",
	227 : "电源恢复",
	229 : "数据口网络异常",
	231 : "数据口网络恢复",
	233 : "磁盘被拔出或异常",
	235 : "磁盘插入",
	//持续事件
	32768 : "录像数据恢复、视频正常",
	32769 : "录像数据丢失",
	32770 : "运动感知停止",
	32771 : "运动感知发生",
	32772 : "视频遮挡停止、视频正常",
	32773 : "视频遮挡发生",
	32774 : "视频断线停止",
	32775 : "视频断线发生",
	32788 : "报警停止",
	32789 : "报警发生",
	32790 : "连接断开",
	32791 : "建立连接",
	32792 : "解锁摄像机",
	32793 : "锁定摄像机",
	32794 : "解锁监视器",
	32795 : "锁定监视器",
	32796 : "停止数字码流传输",
	32797 : "发起数字码流传输",
	32798 : "停止手动录像",
	32799 : "发起手动录像",
	32800 : "断线后恢复",
	32801 : "发生断线",
	32802 : "ROFS报告的错误恢复",
	32803 : "ROFS报告的错误"

};

TNM.Const.LogType = {
	'-1' :	 "未知日志",
	0  :	 "用户登录",
	1  :	 "用户登出",
	2  :	 "查看实时流",
	3  :	 "停止查看实时流",
	4  :	 "云台控制",
	5  :	 "云台锁定",
	6  :	 "云台解锁",
	7  :	 "开始服务器手动录像",
	8  :	 "停止服务器手动录像",
	9  :	 "录像查询",
	10 :	 "开始录像回放",
	11 :	 "停止录像回放",
	12 :	 "开始录像下载",
	13 :	 "停止录像下载",
	14 :	 "事件订阅",
	15 :	 "关闭事件订阅",
	16 :	 "设置画面分割器",
	17 :	 "设置解码器数据源",
	18 :	 "添加电视墙轮询计划",
	19 :	 "修改电视墙轮询计划",
	20 :	 "删除电视墙轮询计划",
	21 :	 "启动临时授权",
	22 :	 "停止临时授权",
	30 :   	 "监视器分屏设置",
	31 :   	 "监视器设置摄像机",
	32 :   	 "监视器锁定",
	33 :   	 "监视器解锁",
	34 :   	 "监视器轮询控制",
	35 :   	 "电视墙事件订阅",
	36 :   	 "关闭电视墙事件订阅",
	400:     "CPU利用率过高",
	401:     "内存利用率过高",
	402:     "网络带宽不足",
	1000:    "TNM 登录",
	1001:    "TNM 登出",
	1002:    "添加机柜",
	1003:    "编辑机柜",
	1004:    "删除机柜",
	1005:    "添加机柜设备",
	1006:    "移动机柜设备",
	1007:    "删除机柜设备",
	1008:    "修改登录方式",
	1009:    "处理故障"
};
TNM.Const.LogFormats = {

};



})();